tutorials/11UnsteadyBBOpen/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
      (0 0 0)
      (1 0 0)
      (0 0.05 0)
      (1 0.05 0)
      (0 1 0)
      (1 1 0)
      (0 1.1 0)
      (1 1.1 0)

      (0 0 0.1)
      (1 0 0.1)
      (0 0.05 0.1)
      (1 0.05 0.1)
      (0 1 0.1)
      (1 1 0.1)
      (0 1.1 0.1)
      (1 1.1 0.1)

      (6 1 0)
      (6 1.1 0)
      (-6 1 0)
      (-6 1.1 0)
  
      (6 1 0.1)
      (6 1.1 0.1)
      (-6 1 0.1)
      (-6 1.1 0.1)
  
);

blocks
(
    hex (0 1 3 2 8 9 11 10) (100 5 1) simpleGrading (1 1 1)
    hex (2 3 5 4 10 11 13 12) (100 85 1) simpleGrading (1 1 1)
    hex (4 5 7 6 12 13 15 14) (100 10 1) simpleGrading (1 1 1)
    hex (5 16 17 7 13 20 21 15) (600 10 1) simpleGrading (1 1 1)
    hex (18 4 6 19 22 12 14 23) (600 10 1) simpleGrading (1 1 1)


);

edges
(
);

boundary
(
    Adiabatic_walls
    {
        type wall;
        faces
	      (
           (6 14 15 7)
 	         (1 9 8 0)
           (16 20 13 5)
           (17 21 15 7)
           (19 23 14 6)
           (22 18 12 4)
        );
    }

    Left
    {
        type wall;
        faces
        (
            (0 8 10 2)
            (2 10 12 4)
        );
    }

   Right
    {
        type wall;
        faces
        (
            (1 9 11 3)
            (3 11 13 5)
        );
    }

   Inlet
    {
        type wall;
        faces
        (
              (18 22 23 19)
        );
    }

    Outlet
    {
        type wall;
        faces
        (
 	        (17 21 20 16)
      
        );
    }
   
    frontAndBack
    {
        type empty;
        faces
        (
            (0 2 3 1)
            (2 4 5 3)
            (4 6 7 5)
            (8 10 11 9)
            (10 12 13 11)
            (12 14 15 13)
            (5 7 17 16)
            (13 15 21 20)
            (4 18 19 6)
            (12 22 23 14)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //

/*convertToMeters 0.1;

vertices
(
      (0 0 0)
      (0.6 0 0)
      (0 0.4 0)
      (0.6 0.4 0)
      (1 0.4 0)
      (0 1 0)
      (0.6 1 0)
      (1 1 0)
  
      (0 0 0.1)
      (0.6 0 0.1)
      (0 0.4 0.1)
      (0.6 0.4 0.1)
      (1 0.4 0.1)
      (0 1 0.1)
      (0.6 1 0.1)
      (1 1 0.1)
);

blocks
(
    hex (0 1 3 2 8 9 11 10) (100 100 1) simpleGrading (1 1 1)
    hex (2 3 6 5 10 11 14 13) (100 100 1) simpleGrading (1 1 1)
    hex (3 4 7 6 11 12 15 14) (100 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    Adiabatic_walls
    {
        type wall;
        faces
  (
           (5 13 14 6)
           (6 14 15 7)
     (4 12 11 3)
     (1 9 8 0)
        );
    }

    Left
    {
        type wall;
        faces
        (
            (0 8 10 2)
            (2 10 13 5)
        );
    }

   Right
    {
        type wall;
        faces
        (
            (3 11 9 1)
        );
    }

   Opening
    {
        type wall;
        faces
        (
            (7 15 12 4)
        );
    }
   
    frontAndBack
    {
        type empty;
        faces
        (
            (0 2 3 1)
            (2 5 6 3)
            (3 6 7 4)
            (8 9 11 10)
            (10 11 14 13)
            (11 12 15 14)
        );
    }
);

mergePatchPairs
(
);
*/
