tutorials/11UnsteadyBBOpen/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    Adiabatic_walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2600;
        startFace       42600;
    }
    Left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          90;
        startFace       45200;
    }
    Right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          90;
        startFace       45290;
    }
    Inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10;
        startFace       45380;
    }
    Outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10;
        startFace       45390;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          44000;
        startFace       45400;
    }
)

// ************************************************************************* //
