tutorials/11UnsteadyBBOpen/0/Tlift0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Tlift0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
22000
(
0.995416
0.986247
0.977079
0.967909
0.958738
0.949564
0.940388
0.931208
...
)
;

boundaryField
{
    Adiabatic_walls
    {
        type            zeroGradient;
    }
    Left
    {
        type            fixedValue;
        value           uniform 1;
    }
    Right
    {
        type            fixedValue;
        value           uniform 0;
    }
    Inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    Outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
